%fft 函数学习示例
%采样定理:
% 当采样频率fs,大于信号中最高频率的2倍时,
% 采样之后的数字信号完整地保留了原始信号中的信息,
% 一般实际应用中保证采样频率为信号最高频率的2.56～4倍
%-----------------------------------------------------------
fs=256;%采样频率
N=256;%采样个数
%采集时刻序列,N行向量.假定从0时刻开始
t=[0:N-1]/fs;
disp('信号原分量:');
%假设信号由以下分量组成
% - 振幅=2 的直流信号
% - 振幅=3,  频率=50Hz,相位=30度的交流信号 
% - 振幅=1.5,频率=75Hz,相位=90度的交流信号 
X=[
2,    0,   0;
3,   50, -30;
1.5, 75,  90;
]
%叠加后的信号,N行向量
S=zeros(size(t));
for i=1:size(X,1)
    S=X(i,1)*cos(X(i,2)*2*pi*t+X(i,3)*pi/180) + S;
end
%添加标准分布的随机嗓声
%S=S+randn(size(t));
%-----------------------------------------------------------
%快速傅氏变换
F=fft(S, N);
%去掉多余的对称部分
F=F(1:N/2+1);
%-----------------------------------------------------------
%取模
A=abs(F);
%提取非0振幅的索引号
v=find(A > 1);
%优化为稀疏阵
A=sparse(1, v, A(v));
%计算分量振幅
% - 谐波振幅 = 对应模/(N/2)
% - 直流振幅 = 对应模/N
A= A/(N/2);
A(1)=A(1)/2;
%-----------------------------------------------------------
%提取各分量
Y=[];
for i=v
    %[振幅,频率,相位角度]
    Y(end+1,:) = [A(i), (i-1)/N * fs, angle(F(i))*180/pi];
end
disp('提取后分量:');
Y
%-----------------------------------------------------------
%使用系统函数画振幅和相位图
freqz(S,1,N);
%手工绘制振幅和相位图
h=fft(S,N*2);
h=h(1:N);
w=linspace(0,pi-pi/N,N);
figure;
%画振幅图
subplot(211);
plot(w/pi,abs(h))
ylabel('幅度(dB)')
axis([-0.01, 1,0,600]);
xlabel('归一化频率(\times\pi rad/sample)')
grid on;

%画相位图
subplot(212);
plot(w/pi,angle(h)*180/pi);
ylabel('相位(角度)')
xlabel('归一化频率(\times\pi rad/sample)')
grid on;

