%kalmanf使用示例.
% 卡尔曼滤波是一种高效率的递归滤波器（自回归滤波器),
% 它能够从一系列的不完全及包含噪声的测量中，估计动态系统的状态
%
clear all
N=50;
Q=1; % 过程(假设符合正态分布)的标准差
R=2; % 测量(假设符合正态分布)的标准差
s=KalmanFilter;%创建卡尔曼滤波器
s.Q = Q^2; % 过程噪声方差
s.R = R^2; % 测量噪声方差

% 产生随机电压,迭代滤波
x=[]; % 真实电压
z=[]; %观测电压,输入值
y=[]; %滤波输出值
for t=1:N
   x(end+1) = 12 + randn*Q; % 真实值
   z(end+1) = x(end) + randn*R; % 观测值
   [s,y(end+1)] = KalmanFilter(s, z(end)); % 卡尔曼滤波
end

%作图
figure
t=1:N;
plot(t,x,'b-', t,z,'r+-',  t,y,'g--');
title('蓝线=真实值,红线=观测值,绿线=滤波值')
